#pragma once

#include <cstddef>
#include "Vector.h"

struct AnimState {
    std::byte pad[4];
    char bUnknown; //0x4
    std::byte pad2[91];
    void* pBaseEntity; //0x60
    void* pActiveWeapon; //0x64
    void* pLastActiveWeapon; //0x68
    float m_flLastClientSideAnimationUpdateTime; //0x6C
    int m_iLastClientSideAnimationUpdateFramecount; //0x70
    float m_flEyePitch; //0x74
    float m_flEyeYaw; //0x78
    float m_flPitch; //0x7C
    float m_flGoalFeetYaw; //0x80
    float m_flCurrentFeetYaw; //0x84
    float m_flCurrentTorsoYaw; //0x88
    float m_flUnknownVelocityLean; //0x8C //changes when moving/jumping/hitting ground
    float m_flLeanAmount; //0x90
    std::byte pad4[4]; //NaN
    float m_flFeetCycle; //0x98 0 to 1
    float m_flFeetYawRate; //0x9C 0 to 1
    float m_fUnknown2;
    //char pad[164];
    float duckAmount;
    //std::byte pad5[80];
    float m_fLandingDuckAdditiveSomething; //0xA8
    float m_fUnknown3; //0xAC
    Vector m_vOrigin; //0xB0, 0xB4, 0xB8
    Vector m_vLastOrigin; //0xBC, 0xC0, 0xC4
    float m_vVelocityX; //0xC8
    float m_vVelocityY; //0xCC
    std::byte pad5[4];
    float m_flUnknownFloat1; //0xD4 Affected by movement and direction
    std::byte pad6[8];
    float m_flUnknownFloat2; //0xE0 //from -1 to 1 when moving and affected by direction
    float m_flUnknownFloat3; //0xE4 //from -1 to 1 when moving and affected by direction
    float m_unknown; //0xE8
    float speed_2d; //0xEC
    float flUpVelocity; //0xF0
    float m_flSpeedNormalized; //0xF4 //from 0 to 1
    float footSpeed;
    float footSpeed2;
    //std::byte pad6[22];
    float m_flTimeSinceStartedMoving; //0x100
    float m_flTimeSinceStoppedMoving; //0x104
    unsigned char m_bOnGround; //0x108
    int m_bInHitGroundAnimation; //0x109
    std::byte pad7[10];
    float m_flLastOriginZ; //0x114
    float m_flHeadHeightOrOffsetFromHittingGroundAnimation; //0x118 from 0 to 1, is 1 when standing
    float stopToFullRunningFraction;
    std::byte pad9[4];
    float UnknownFraction;
    std::byte pad8[526];
    float velocitySubtractY;
};

/*
class AnimationLayer
{
public:
    char  pad_0000[20];
    uint32_t m_nOrder; //0x0014
    uint32_t m_nSequence; //0x0018
    float_t m_flPrevCycle; //0x001C
    float_t m_flWeight; //0x0020
    float_t m_flWeightDeltaRate; //0x0024
    float_t m_flPlaybackRate; //0x0028
    float_t m_flCycle; //0x002C
    void* m_pOwner; //0x0030 // player's thisptr
    char  pad_0038[4]; //0x0034
}; //Size: 0x0038
*/
/*
AnimationLayer& Entity::GetAnimOverlay(int Index)
{
    return (*(AnimationLayer**)((DWORD)this + 0x2970))[Index];
}
*/
enum acts
{
    ACT_RESET,
    ACT_IDLE,
    ACT_TRANSITION,
    ACT_COVER,
    ACT_COVER_MED,
    ACT_COVER_LOW,
    ACT_WALK,
    ACT_WALK_AIM,
    ACT_WALK_CROUCH,
    ACT_WALK_CROUCH_AIM,
    ACT_RUN,
    ACT_RUN_AIM,
    ACT_RUN_CROUCH,
    ACT_RUN_CROUCH_AIM,
    ACT_RUN_PROTECTED,
    ACT_SCRIPT_CUSTOM_MOVE,
    ACT_RANGE_ATTACK1,
    ACT_RANGE_ATTACK2,
    ACT_RANGE_ATTACK1_LOW,
    ACT_RANGE_ATTACK2_LOW,
    ACT_DIESIMPLE,
    ACT_DIEBACKWARD,
    ACT_DIEFORWARD,
    ACT_DIEVIOLENT,
    ACT_DIERAGDOLL,
    ACT_FLY,
    ACT_HOVER,
    ACT_GLIDE,
    ACT_SWIM,
    ACT_JUMP,
    ACT_HOP,
    ACT_LEAP,
    ACT_LAND,
    ACT_CLIMB_UP,
    ACT_CLIMB_DOWN,
    ACT_CLIMB_DISMOUNT,
    ACT_SHIPLADDER_UP,
    ACT_SHIPLADDER_DOWN,
    ACT_STRAFE_LEFT,
    ACT_STRAFE_RIGHT,
    ACT_ROLL_LEFT,
    ACT_ROLL_RIGHT,
