#pragma once

#include "offsets.h"
#include <array>
#include "usercmd.h"
#include "CBaseAnimState.h"

class IClientRenderable;
class IClientNetworkable;
class IClientUnknown;
class IClientThinkable;
struct model_t;
class CBaseCombatWeapon;
class ClientClass;
#define ACTIVITY_NOT_AVAILABLE		-1

static const char *Ranks[] =
{
    "Unranked",
    "Silver I",
    "Silver II",
    "Silver III",
    "Silver IV",
    "Silver Elite",
    "Silver Elite Master",

    "pWhite Nova I",
    "pWhite Nova II",
    "pWhite Nova III",
    "pWhite Nova Master",
    "Master Guardian I",
    "Master Guardian II",

    "Master Guardian Elite",
    "Distinguished Master Guardian",
    "Legendary Eagle",
    "Legendary Eagle Master",
    "Supreme Master First Class",
    "The Global Elite"
};
class CollisionProperty
{
public:
    Vector VecMins()
    {
        return *reinterpret_cast<Vector*>((DWORD)this + 0x8);
    }
    Vector VecMaxs()
    {
        return *reinterpret_cast<Vector*>((DWORD)this + 0x14);
    }
};


typedef unsigned short ClientShadowHandle_t;
typedef unsigned short ClientRenderHandle_t;
typedef unsigned short ModelInstanceHandle_t;
typedef unsigned char uint8;
class IClientRenderable
{
public:
    virtual IClientUnknown*            GetIClientUnknown() = 0;
    virtual Vector const&              GetRenderOrigin(void) = 0;
    virtual QAngle const&              GetRenderAngles(void) = 0;
    virtual bool                       ShouldDraw(void) = 0;
    virtual int                        GetRenderFlags(void) = 0; // ERENDERFLAGS_xxx
    virtual void                       Unused(void) const {}
    virtual ClientShadowHandle_t       GetShadowHandle() const = 0;
    virtual ClientRenderHandle_t&      RenderHandle() = 0;
    virtual const model_t*             GetModel() const = 0;
    virtual int                        DrawModel(int flags, const int /*RenderableInstance_t*/ &instance) = 0;
    virtual int                        GetBody() = 0;
    virtual void                       GetColorModulation(float* color) = 0;
    virtual bool                       LODTest() = 0;
    virtual bool                       SetupBones(matrix3x4_t *pBoneToWorldOut, int nMaxBones, int boneMask, float currentTime) = 0;
    virtual void                       SetupWeights(const matrix3x4_t *pBoneToWorld, int nFlexWeightCount, float *pFlexWeights, float *pFlexDelayedWeights) = 0;
    virtual void                       DoAnimationEvents(void) = 0;
    virtual void* /*IPVSNotify*/       GetPVSNotifyInterface() = 0;
    virtual void                       GetRenderBounds(Vector& mins, Vector& maxs) = 0;
    virtual void                       GetRenderBoundsWorldspace(Vector& mins, Vector& maxs) = 0;
    virtual void                       GetShadowRenderBounds(Vector &mins, Vector &maxs, int /*ShadowType_t*/ shadowType) = 0;
    virtual bool                       ShouldReceiveProjectedTextures(int flags) = 0;
    virtual bool                       GetShadowCastDistance(float *pDist, int /*ShadowType_t*/ shadowType) const = 0;
    virtual bool                       GetShadowCastDirection(Vector *pDirection, int /*ShadowType_t*/ shadowType) const = 0;
    virtual bool                       IsShadowDirty() = 0;
    virtual void                       MarkShadowDirty(bool bDirty) = 0;
    virtual IClientRenderable*         GetShadowParent() = 0;
    virtual IClientRenderable*         FirstShadowChild() = 0;
    virtual IClientRenderable*         NextShadowPeer() = 0;
    virtual int /*ShadowType_t*/       ShadowCastType() = 0;
    virtual void                       CreateModelInstance() = 0;
    virtual ModelInstanceHandle_t      GetModelInstance() = 0;
    virtual const matrix3x4_t&         RenderableToWorldTransform() = 0;
    virtual int                        LookupAttachment(const char *pAttachmentName) = 0;
    virtual   bool                     GetAttachment(int number, Vector &origin, QAngle &angles) = 0;
    virtual bool                       GetAttachment(int number, matrix3x4_t &matrix) = 0;
    virtual float*                     GetRenderClipPlane(void) = 0;
    virtual int                        GetSkin() = 0;
    virtual void                       OnThreadedDrawSetup() = 0;
    virtual bool                       UsesFlexDelayedWeights() = 0;
    virtual void                       RecordToolMessage() = 0;
    virtual bool                       ShouldDrawForSplitScreenUser(int nSlot) = 0;
    virtual uint8                      OverrideAlphaModulation(uint8 nAlpha) = 0;
    virtual uint8                      OverrideShadowAlphaModulation(uint8 nAlpha) = 0;
    bool SetupBones(VMatrix *pBoneToWorldOut, int nMaxBones, int boneMask, float currentTime)
    {
        typedef bool(__thiscall* oSetupBones)(PVOID, VMatrix *, int, int, float);
        return CallVFunction< oSetupBones>(this, 13)(this, pBoneToWorldOut, nMaxBones, boneMask, currentTime);
    }
    const model_t* GetModel() //void*
    {
        typedef const model_t*(__thiscall* OriginalFn)(PVOID);
        return CallVFunction<OriginalFn>(this, 8)(this);
    }
};

class IClientNetworkable
{
public:
    virtual IClientUnknown*	GetIClientUnknown() = 0;
    virtual void			Release() = 0;
    virtual void*			GetClientClass() = 0;// FOR NETVARS FIND YOURSELF ClientClass* stuffs
    virtual void             NotifyShouldTransmit(int state) = 0;
    virtual void             OnPreDataChanged(int updateType) = 0;
    virtual void             OnDataChanged(int updateType) = 0;
    virtual void             PreDataUpdate(int updateType) = 0;
    virtual void             PostDataUpdate(int updateType) = 0;
    virtual void			unknown();
    virtual bool			IsDormant(void) = 0;
    virtual int				Index(void) const = 0;
    virtual void			ReceiveMessage(int classID /*, bf_read &msg*/) = 0;
    virtual void*			GetDataTableBasePtr() = 0;
    virtual void			SetDestroyedOnRecreateEntities(void) = 0;

};
class IClientUnknown
{
public:
    virtual CollisionProperty*		GetCollideable() = 0;
    virtual IClientNetworkable*	GetClientNetworkable() = 0;
    virtual IClientRenderable*	GetClientRenderable() = 0;
    virtual void*		GetIClientCBaseEntity() = 0;
    virtual void*		GetBaseCBaseEntity() = 0;
    virtual IClientThinkable*	GetClientThinkable() = 0;
};
class IClientThinkable
{
public:
    virtual IClientUnknown*		GetIClientUnknown() = 0;
    virtual void				ClientThink() = 0;
    virtual void*				GetThinkHandle() = 0;
    virtual void				SetThinkHandle(void* hThink) = 0;
    virtual void				Release() = 0;
};

class VarMapEntry_t
{
public:
    unsigned short		type;
    unsigned short		m_bNeedsToInterpolate;	// Set to false when this var doesn't
                                                // need Interpolate() called on it anymore.
    void				*data;
    void	*watcher;
};

struct VarMapping_t
{
    CUtlVector<VarMapEntry_t>	m_Entries;
    int							m_nInterpolatedEntries;
    float						m_lastInterpolationTime;
};

class CBaseAnimating
{
public:

    enum
    {
        NUM_POSEPAREMETERS = 24,
        NUM_BONECTRLS = 4
    };



};

class CAnimationLayer
{
public:
    char  pad_0000[20];
    uint32_t m_nOrder; //0x0014
    uint32_t m_nSequence; //0x0018
    float_t m_flPrevCycle; //0x001C
    float_t m_flWeight; //0x0020
    float_t m_flWeightDeltaRate; //0x0024
    float_t m_flPlaybackRate; //0x0028
    float_t m_flCycle; //0x002C
    void *m_pOwner; //0x0030 // player's thisptr
    char  pad_0038[4]; //0x0034
}; //Size: 0x0038

template <typename T>
__forceinline T Member(void *base, DWORD offset = 0)
{
    return (T)((DWORD)base + offset);
}


struct inputdata_t;
typedef enum _fieldtypes
{
    FIELD_VOID = 0,			// No type or value
    FIELD_FLOAT,			// Any floating point value
    FIELD_STRING,			// A string ID (return from ALLOC_STRING)
    FIELD_VECTOR,			// Any vector, QAngle, or AngularImpulse
    FIELD_QUATERNION,		// A quaternion
    FIELD_INTEGER,			// Any integer or enum
    FIELD_BOOLEAN,			// boolean, implemented as an int, I may use this as a hint for compression
    FIELD_SHORT,			// 2 byte integer
    FIELD_CHARACTER,		// a byte
    FIELD_COLOR32,			// 8-bit per channel r,g,b,a (32bit color)
    FIELD_EMBEDDED,			// an embedded object with a datadesc, recursively traverse and embedded class/structure based on an additional typedescription
    FIELD_CUSTOM,			// special type that contains function pointers to it's read/write/parse functions

    FIELD_CLASSPTR,			// CBaseEntity *
    FIELD_EHANDLE,			// Entity handle
    FIELD_EDICT,			// edict_t *

    FIELD_POSITION_VECTOR,	// A world coordinate (these are fixed up across level transitions automagically)
    FIELD_TIME,				// a floating point time (these are fixed up automatically too!)
    FIELD_TICK,				// an integer tick count( fixed up similarly to time)
    FIELD_MODELNAME,		// Engine string that is a model name (needs precache)
    FIELD_SOUNDNAME,		// Engine string that is a sound name (needs precache)

    FIELD_INPUT,			// a list of inputed data fields (all derived from CMultiInputVar)
    FIELD_FUNCTION,			// A class function pointer (Think, Use, etc)

    FIELD_VMATRIX,			// a vmatrix (output coords are NOT worldspace)

                            // NOTE: Use float arrays for local transformations that don't need to be fixed up.
                            FIELD_VMATRIX_WORLDSPACE,// A VMatrix that maps some local space to world space (translation is fixed up on level transitions)
                            FIELD_MATRIX3X4_WORLDSPACE,	// matrix3x4_t that maps some local space to world space (translation is fixed up on level transitions)

                            FIELD_INTERVAL,			// a start and range floating point interval ( e.g., 3.2->3.6 == 3.2 and 0.4 )
                            FIELD_MODELINDEX,		// a model index
                            FIELD_MATERIALINDEX,	// a material index (using the material precache string table)

                            FIELD_VECTOR2D,			// 2 floats

                            FIELD_TYPECOUNT,		// MUST BE LAST
} fieldtype_t;

class ISaveRestoreOps;
class C_BaseEntity;
//
// Function prototype for all input handlers.
//
typedef void (C_BaseEntity::*inputfunc_t)(inputdata_t &data);

struct datamap_t;
class typedescription_t;

enum
{
    TD_OFFSET_NORMAL = 0,
    TD_OFFSET_PACKED = 1,

    // Must be last
    TD_OFFSET_COUNT,
};

class typedescription_t
{
public:
    int32_t fieldType; //0x0000
    char* fieldName; //0x0004
    int fieldOffset[TD_OFFSET_COUNT]; //0x0008
    int16_t fieldSize_UNKNWN; //0x0010
    int16_t flags_UNKWN; //0x0012
    char pad_0014[12]; //0x0014
    datamap_t* td; //0x0020
    char pad_0024[24]; //0x0024
}; //Size: 0x003C


   //-----------------------------------------------------------------------------
   // Purpose: stores the list of objects in the hierarchy
   //            used to iterate through an object's data descriptions
   //-----------------------------------------------------------------------------
struct datamap_t
{
    typedescription_t    *dataDesc;
    int                    dataNumFields;
    char const            *dataClassName;
    datamap_t            *baseMap;

    bool                chains_validated;
    // Have the "packed" offsets been computed
    bool                packed_offsets_computed;
    int                    packed_size;
};


typedef unsigned long CBaseHandle;
enum DataUpdateType_txd
{
    DATA_UPDATE_CREATEDxd = 0,
    DATA_UPDATE_DATATABLE_CHANGEDxd,
};
class CBaseEntity
{
public:


    float GetNextAttack()
    {
        return *reinterpret_cast<float*>(uint32_t(this) + offys.m_flNextAttack);
    }



